// Lab1-1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    int a = 1;
    printf("a = %d\n", a);
    printf("sizeof = %d\n\n", sizeof(a));

    short b = 1;
    printf("b = %d\n", b);
    printf("sizeof = %d\n\n", sizeof(b));

    long c = 1;
    printf("c = %d\n", c);
    printf("sizeof = %d\n\n", sizeof(c));

    char d = 1;
    printf("d = %d\n", d);
    printf("sizeof = %d\n\n", sizeof(d));

    float e = 1;
    printf("e = %f\n", e);
    printf("sizeof = %d\n\n", sizeof(e));

    double f = 1;
    printf("f = %lf\n", f);
    printf("sizeof = %d\n\n", sizeof(f));

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
