#include "F_prnt.h"
#include <iostream>
using namespace std;
#define DEBUG

void prnt(lists nep[])
{
#ifdef DEBUG
	cout << __DATE__ << endl << __TIME__ << endl << __FILE__ << endl << "Имя функции: " << __FUNCTION__ << endl << endl;
#endif
	printf("------------------------------------------------------------------------------------------\n");
	printf("|					Прайс-лист					 |\n");
	printf("|----------------------------------------------------------------------------------------|\n");
	printf("| Наименование товара | Тип товара | Цена за 1 шт (грн) |Минимальное количество в партии |\n");
	printf("|---------------------|------------|------------------- |--------------------------------|\n");
	int n = 10;
	for (int i = 0; i < n; i++)
		printf("| %-19s | %-10c | %-18.2f | %-30d |\n",
			nep[i].name, nep[i].type, nep[i].price, nep[i].mink);
	printf("|----------------------------------------------------------------------------------------|\n");
	printf("|                        Примечание: К - канцтовары; О - оргтехника;                     |\n");
	printf("------------------------------------------------------------------------------------------\n");

#ifdef DEBUG
	cout << endl << __DATE__ << endl << __TIME__ << endl << __FILE__ << endl << "Имя функции: " << __FUNCTION__ << endl << endl;
#endif
}
