#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "windows.h";
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	/* 
	char name1[7] = "Папка", name2[8] = "Бумага", name3[12] = "Калькулятор";
	char sc1 = 'К', sc2 = 'K', sc3 = 'O';
	float cnt1 = 4.75, cnt2 = 13.90, cnt3 = 411.00;
	float sq1 = 4, sq2 = 10, sq3 = 1;	*/

	char name1[7] = "Папка", name2[8] = "Бумага", name3[12] = "Калькулятор";
	char sc1 = 'К', sc2 = 'K', sc3 = 'O';
	float cnt1 = 4.75, cnt2 = 13.90, cnt3 = 411.00;
	float sq1 = 4, sq2 = 10, sq3 = 1;

	/* Введение фактических данных*/
	printf("1. Введите: Наименование, Тип, Цену, Минимальное количество в партии >");
	scanf("%s %c %f %f", name1, &sc1, &cnt1, &sq1);
	printf("2. Введите: Наименование, Тип, Цену, Минимальное количество в партии >");
	scanf("%s %c %f %f", name2, &sc2, &cnt2, &sq2);
	printf("3. Введите: Наименование, Тип, Цену, Минимальное количество в партии >");
	scanf("%s %c %f %f", name3, &sc3, &cnt3, &sq3);

	/* Вывод таблицы */
	/* вывод заголовков */
	printf("------------------------------------------------------------------------------------------\n");
	printf("|					Прайс-лист					 |\n");
	printf("|----------------------------------------------------------------------------------------|\n");
	printf("| Наименование товара | Тип товара | Цена за 1 шт (грн) |Минимальное количество в партии |\n");
	printf("|---------------------|------------|------------------- |--------------------------------|\n");
	/* вывод строк фактических данных */
	printf("| %19s | %10c | %18f | %-30f |\n", name1, sc1, cnt1, sq1);
	printf("| %19s | %10c | %18f | %-30f |\n", name2, sc2, cnt2, sq2);
	printf("| %19s | %10c | %18f | %-30f |\n", name3, sc3, cnt3, sq3);
	/* вывод примечаний */
	printf("|----------------------------------------------------------------------------------------|\n");
	printf("|                        Примечание: К - канцтовары;                                     |\n");
	printf("|                                    О - оргтехника;                                     |\n");
	printf("------------------------------------------------------------------------------------------\n");
	return 0;
}