/*
	Лабораторная работа №2 (1й семестр)
	Базовые типы данных и ввод-вывод
	http://khpi-iip.mipk.kharkiv.edu/library/pgm/lab/l02.html
*/

#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "windows.h";
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	//char name1[9], name2[9], name3[9];
	//char sc1, sc2, sc3;
	//int cnt1, cnt2, cnt3;
	//float sq1, sq2, sq3;

	char name1[7] = "Папка", name2[8] = "Бумага", name3[12] = "Калькулятор"; //strcpy(name1, "Тодайдзи");
	char sc1 = 'К', sc2 = 'К', sc3 = 'О';
	float cnt1, cnt2, cnt3;
	float sq1, sq2, sq3;
	/* Введение фактических данных*/
	printf("1. Введите: Наименование, Тип, Цену, Минимальное количество в партии >");
	scanf("%s %c %f %f", name1, &sc1, &cnt1, &sq1);
	printf("2. Введите: Наименование, Тип, Цену, Минимальное количество в партии >");
	scanf("%s %c %f %f", name2, &sc2, &cnt2, &sq2);
	printf("3. Введите: Наименование, Тип, Цену, Минимальное количество в партии >");
	scanf("%s %c %f %f", name3, &sc3, &cnt3, &sq3);

	/* Вывод таблицы */
	/* вывод заголовков */
	printf("------------------------------------------------------------------------------------------\n");
	printf("|										Прайс-лист									     |\n");
	printf("|----------------------------------------------------------------------------------------|\n");
	printf("| Наименование товара | Тип товара | Цена за 1 шт (грн) |Минимальное количество в партии |\n");
	printf("|---------------------|------------|------------------- |--------------------------------|\n");
	/* вывод строк фактических данных */
	printf("| %19s | %10c | %18f | %-30f |\n", name1, sc1, cnt1, sq1);
	printf("| %19s | %10c | %18f | %-30f |\n", name2, sc2, cnt2, sq2);
	printf("| %19s | %10c | %18f | %-30f |\n", name3, sc3, cnt3, sq3);
	/* вывод примечаний */
	printf("|----------------------------------------------------------------------------------------|\n");
	printf("|                        Примечание: К - канцтовары;                                     |\n");
	printf("|                                    О - оргтехника;                                     |\n");
	printf("------------------------------------------------------------------------------------------\n");
	return 0;
}